export function dynamicSnippets(): any {
    let data = {
        "Если": {
            "body": "Если $1 Тогда\n\t$0\nКонецЕсли;",
            "description": "Если"
        },
        "ЕслиИначе": {
            "body": "Если $1 Тогда\n\t$0\nИначе\nКонецЕсли;",
            "description": "ЕслиИначе"
        },
        "Пока": {
            "body": "Пока $1 Цикл\n\t$0\nКонецЦикла;",
            "description": "Пока"
        },
        "Для": {
            "body": "Для $1 По  Цикл\n\t$0\nКонецЦикла;",
            "description": "Для"
        },
        "Для каждого": {
            "body": "Для каждого $1 Из  Цикл\n\t$0\nКонецЦикла;",
            "description": "Для каждого"
        },
        "Процедура": {
            "body": "Процедура $1()\n\t$0\nКонецПроцедуры",
            "description": "Процедура"
        },
        "Функция": {
            "body": "Функция $1()\n\t$0\nКонецФункции",
            "description": "Функция"
        },
        "Попытка": {
            "body": "Попытка\n\t$0\nИсключение\nКонецПопытки;",
            "description": "Попытка"
        },
        "Условная конструкция ?(,,)": {
            "body": "?($0, , )",
            "description": "Условная конструкция ?(,,)"
        },
        "Группировка блока кода": {
            "body": "//{ $1\n$0\n//}",
            "description": "Группировка блока кода"
        },
        "ЕСТЬNULL(<Поле>, 0)": {
            "body": "ЕСТЬNULL($0, 0)",
            "description": "ЕСТЬNULL(<Поле>, 0)"
        },
        "ЕСТЬNULL(<Поле>, |)": {
            "body": "ЕСТЬNULL($0, $1)",
            "description": "ЕСТЬNULL(<Поле>, |)"
        }
    };
    return data;
}
